var mobile = 0;
var route = Array();
var map;
var flightPath = Array();
var overdiv = Array();
var marker = Array();
var inform = Array();
var all=1256;
var firstday_day = 19;
var firstday_month = 1;
var firstday_year = 2020;
var lastday_day = 25;
var lastday_month = 2;
var lastday_year = 2020;
var isEmpty = new Array();
//json 파일로 json 병원이름{{감염자번호{}}
//json 2개로 

var point = [			//장소별 좌표 59 60 61 62 63 65 64 66 65 67 68 69 70 71        70 68 67 72 65 81 73 74 75 76 65 62      65 59 60 77 65 72     65 78    65 79 80 65 19
	{x: 30.590647, y: 114.306577, right: 0, name: "우한"},			//0우한(자세한 장소 특정 불가)
	{x: 31.145436, y: 121.807947, right: 0, name: "상하이 푸둥 국제공항"},			//1상하이공항
	{x: 36.266583, y: 120.383135, right: 0, name: "칭다오 국제공항"},			//2청도공항
	{x: 37.459818, y: 126.440561, right: 1, name: "인천공항"},			//3인천공항
	{x: 37.558726, y: 126.802931, right: 1, name: "김포공항"},			//4김포공항
	{x: 37.478525, y: 126.668504, right: 1, hospital: 1, name: "인천의료원"},			//5인천의료원
	{x: 37.567225, y: 127.005654, right: 1, hospital: 1, name: "국립중앙의료원"},			//6국립중앙의료원
	{x: 37.532343, y: 126.990352, right: 0, hospital: 1, name: "서울 시내 보건소 (자료 미제공으로 임시 표기하였습니다.)"},			//7서울 용산구보건소(임시)
	{x: 37.524360, y: 127.027933, right: 1, name: "강남구 글로비 성형외과"},			//8강남구 글로비 성형외과
	{x: 37.502991, y: 127.049133, right: 1, name: "강남구 호텔 뉴브"},			//9강남구 호텔 뉴브
	{x: 37.526086, y: 127.016682, right: 0, name: "한강 산책로 (자료 미제공으로 임시 표기하였습니다.)"},			//10한강 산책로(자세한 장소 특정 불가)
	{x: 37.524532, y: 127.015727, right: 1, name: "GS25 한강잠원 1호점"},			//11한강 GS25 한강잠원 1호점
	{x: 37.499731, y: 127.037003, right: 0, name: "역삼동 일대 음식점 (자료 미제공으로 임시 표기하였습니다.)"},			//12역삼동(자세한 장소 특정 불가)
	{x: 37.499188, y: 127.061921, right: 0, name: "대치동 일대 음식점 (자료 미제공으로 임시 표기하였습니다.)"},			//13대치동(자세한 장소 특정 불가)
	{x: 37.638829, y: 126.841228, right: 0, name: "일산 고향집 (자료 미제공으로 임시 표기하였습니다.)"},			//14일산(자세한 장소 특정 불가)
	{x: 37.642070, y: 126.831243, right: 1, hospital: 1, name: "일산 명지병원"},			//15일산 명지병원
	{x: 37.079411, y: 127.057664, right: 1, name: "평택 송탄터미널"},			//16평택 송탄터미널
	{x: 37.052010, y: 127.057333, right: 1, name: "365연합의원"},			//17 365연합의원
	{x: 37.065561, y: 127.066022, right: 0, name: "평택 시내 보건소 (자료 미제공으로 임시 표기하였습니다.)"},			//18송탄보건소	(임시)
	{x: 37.351316, y: 127.123424, right: 1, hospital: 1, name: "서울대학교 병원"},			//19분당 서울대병원
	{x: 30.776604, y: 114.212452, right: 1, name: "중국 텐허공항"},			//20중국 텐허공항
	{x: 37.506973, y: 126.960522, right: 1, hospital: 1, name: "중앙대학교병원"},				//21중앙대학병원
	{x: 36.896079, y: 127.535775, right: 1, name: "진천 국가공무원 인재개발원"},			//22진천 인재개발원
	{x: 36.740371, y: 126.987224, right: 1, name: "아산 경찰 인재개발원"},				//23아산 인재개발원
	{x: 28.196654, y: 113.220830, right: 1, name: "장사 국제공항"},				//24장사 국제공항
	{x: 37.580092, y: 127.015603, right: 1, name: "선녀보살"},			//25선녀보살
	{x: 37.593816, y: 127.018402, right: 0, name: "성북구 동선동 자택 (자료 미제공으로 임시 표기하였습니다.)"},	//26 5번환자 성북구 동선동 자택
	{x: 37.606489, y: 127.092758, right: 1, hospital: 1, name: "중량구 보건소"},		//27중량구보건소
	{x: 37.612734, y: 127.098166, right: 1, hospital: 1, name: "서울의료원"},			//28서울의료원
	{x: 37.527735, y: 127.032479, right: 1, name: "강남구 한일관"},			//29강남구 한일관
	{x: 37.589001, y: 126.997311, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//30종로구명륜동(6번환자 자택)
	{x: 37.586332, y: 126.999827, right: 1, name: "명륜교회"},				//31명륜교회
	{x: 37.582138, y: 126.983114, right: 0, name: "종로구 일대 음식점 (자료 미제공으로 임시 표기하였습니다.)"},	//32종로구 일대 음식점
	{x: 37.612762, y: 127.097903, right: 0, name: "자택(자료 미제공으로 임시 표기하였습니다.)"}, //33임시표기 7번째환자 자택
	{x: 37.612503, y: 127.098614, right: 0, hospital: 1, name: "보건소 (자료 미제공으로 임시 표기하였습니다.)"}, //34임시표기 7번째환자 보건소
	{x: 37.592710, y: 127.016293, right: 0, name: "숙소 (자료 미제공으로 임시 표기하였습니다.)"},		//35 5번환자의 숙소(임시)
	{x: 37.589588, y: 127.009757, right: 1, name: "슈퍼마켓(두꺼비마트)"},					//36 두꺼비마트
	{x: 37.588895, y: 127.007755, right: 0, name: "다이소"},								//37 5번환자 숙소근처 다이소
	{x: 37.590327, y: 127.015215, right: 1, name: "선호케어"},								//38 선호케어
	{x: 37.596223, y: 127.015672, right: 1, name: "돈암동 떡볶이"},						//39 돈암동 떡볶이
	{x: 37.640996, y: 127.021732, right: 1, name: "럭키후레쉬마트"},							//40 럭키후레쉬마트
	{x: 37.591669, y: 127.018413, right: 1, name: "예쁠레뷰티라인"},							//41 5번환자 예쁠레뷰티라인
	{x: 37.402739, y: 126.973610, right: 0, name: "가락홈마트"},							//42 가락시장
	{x: 37.589034, y: 127.091942, right: 0, name: "이가네바지락칼국수"},					//43 이가네바지락칼숙수
	{x: 37.523674, y: 127.046515, right: 1, name: "와이즈웨딩"},							//44 와이즈웨딩
	{x: 37.477327, y: 127.018985, right: 0, name: "서초구 아들의 집 (자료 미제공으로 임시 표기하였습니다.)"},						//45 8번환자 아들의 집
	{x: 37.479123, y: 127.017504, right: 0, name: "서초구 소재 음식점 (자료 미제공으로 임시 표기하였습니다.)"},					//46 8번환자 아들집 음식점
	{x: 35.968880, y: 126.734239, right: 0, name: "군산시 소재 음식점1 (자료 미제공으로 임시 표기하였습니다.)"},						//47 8번환자 군산 음식점1
	{x: 35.966383, y: 126.726339, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},									//48 8번환자 자택
	{x: 35.986660, y: 126.708125, right: 1, name: "아센사우나"},																					//49아센사우나
	{x: 35.976044, y: 126.711163, right: 0, name: "군산시 소재 음식점2 (자료 미제공으로 임시 표기하였습니다.)"},						//50 8번환자 군산 음식점2
	{x: 35.968124, y: 126.716098, right: 1, hospital: 1, name: "유남진내과의원"},																				//51 유남진내과
	{x: 35.954882, y: 126.711991, right: 1, hospital: 1, name: "군산의료원"},																				//52군산의료원
	{x: 35.954882, y: 126.711991, right: 1, name: "우리떡갈비"},																				//53우리떡갈비
	{x: 35.982740, y: 126.734863, right: 1, name: "이마트 군산점"},																			//54이마트 군산점
	{x: 35.964378, y: 126.959639, right: 1, hospital: 1, name: "원광대학교병원"},																//55원광대학교 병원
	{x: 37.594007, y: 127.018656, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},					//56 9번째환자 자택
	{x: 37.641107, y: 126.792000, right: 1, name: "메종드아이디헤어 백석벨라시타점"},										//57 메종드아이디헤어 백석벨라시타점
	{x: 37.590591, y: 127.014430, right: 1, name: "식자재유통센터"},													//58 식자재유통
	{x: 37.557067, y: 127.007654, right: 1, name: "신라면세점"},															//59신라면세점
	{x: 37.560025, y: 126.975894, right: 0, name: "서울시 중구 소재 음식점 (자료 미제공으로 임시 표기하였습니다.)"},	//60서울시 중구 소재 음식점
	{x: 37.559172, y: 126.977668, right: 0, name: "서울시 중구 소재 남대문쇼핑 (자료 미제공으로 임시 표기하였습니다.)"},	//61서울시 중구 소재 남대문쇼핑
	{x: 37.485818, y: 126.781013, right: 1, name: "cgv 부천역점"},													//62 cgv 부천역점
	{x: 37.482784, y: 126.780367, right: 1, name: "왕중왕(음식점)"},													//63왕중왕
	{x: 37.461767, y: 126.631614, right: 1, name: "인천출입국사무소"},												//64인천출입국사무소
	{x: 37.485213, y: 126.780809, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//65 1214자택
	{x: 37.454795, y: 126.651908, right: 0, name: "친구 집 (자료 미제공으로 임시 표기하였습니다.)"},			//66 12친구집
	{x: 37.552998, y: 126.972621, right: 1, name: "서울역"},																//67 서울역
	{x: 37.764066, y: 128.898765, right: 1, name: "강릉역"},																//68 강릉역
	{x: 37.754986, y: 128.899824, right: 1, name: "강릉 부자대게"},														//69강릉부자대게
	{x: 37.683395, y: 129.043807, right: 1, name: "썬크루즈리조트"},														//70썬크루즈리조트
	{x: 37.690557, y: 129.032117, right: 1, name: "정동진초당순두부"},													//71정동진초당순두부
	{x: 37.483678, y: 126.778104, right: 1, hospital: 1, name: "부천속내과"},													//72부천속내과
	{x: 37.266166, y: 126.999705, right: 1, name: "수원역"},														//73수원역
	{x: 37.279546, y: 127.022017, right: 0, name: "수원 친척집 (자료 미제공으로 임시 표기하였습니다.)"},			//74 12친척집
	{x: 37.343579, y: 126.931060, right: 0, name: "군포 친척집 (자료 미제공으로 임시 표기하였습니다.)"},			//75 12친척집2
	{x: 37.359117, y: 126.930956, right: 1, hospital: 1, name: "더건강한내과"},															//76 더 건강한내과
	{x: 37.483594, y: 126.781794, right: 1, name: "부천종로약국"},															//77 부천종로약국
	{x: 37.494140, y: 126.781039, right: 1, hospital: 1, name: "부천시 보건소"},															//78 부천시보건소
	{x: 37.498393, y: 126.762855, right: 1, hospital: 1, name: "순천향대학교부속부천병원"},													//79부천병원
	{x: 37.484036, y: 126.782672, right: 1, name: "이마트 부천점"},															//80 이마트 부천점
	{x: 37.484036, y: 126.782705, right: 0, name: "부천역"},																//81 부천역
	{x: 37.351001, y: 127.122968, right: 1, hospital: 1, name: "서울대병원"},																//82분당서울대병원2
	{x: 37.392693, y: 127.149129, right: 1, hospital: 1, name: "국군수도병원\n(정부에서 정보를 아무것도 주지 않았기에 이렇게 표시합니다. 죄송합니다.)"},	//83 국군수도병원
	{x: 35.082306, y: 126.829592, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},							//84 16번째 환자 자택
	{x: 34.931555, y: 126.795585, right: 0, name: "친정집 (자료 미제공으로 임시 표기하였습니다.)"},						//85 16번째 환자 친정집
	{x: 35.141904, y: 126.921674, right: 1, hospital: 1, name: "전남대학교병원"},												//86 전남대학교병원
	{x: 35.140742, y: 126.922561, right: 1, hospital: 1, name: "전남대학교병원 응급의료센터"},							//87 전남대학교병원 응급의료센터
	{x: 35.175789, y: 126.818139, right: 1, name: "광주21세기병원"},									//88 광주21세기병원
	{x: 1.363689, y: 103.991148, right: 0, name: "싱가포르(자료 미제공으로 임시 표기하였습니다.)"},			//89 싱가포르
	{x: 37.549050, y: 126.970452, right: 1, name: "북창동순두부"},														//90 북창동순두부
	{x: 37.521067, y: 126.934372, right: 1, name: "중앙온누리약국"},													//91 중앙온누리약국
	{x: 35.879693, y: 128.628304, right: 1, name: "동대구역"},															//92 동대구역
	{x: 35.868440, y: 128.626374, right: 0, name: "본가 (자료 미제공으로 임시 표기하였습니다.)"},			//93 17번째 환자 본가
	{x: 35.870343, y: 128.615327, right: 0, name: "처가 (자료 미제공으로 임시 표기하였습니다.)"},			//94 17번째 환자 처가
	{x: 35.842623, y: 128.625041, right: 1, name: "대구 수성구 소재 미니주유소"},											//95 대구 수성구 소재 미니주유소
	{x: 37.487363, y: 127.101576, right: 1, name: "수서역"},																//96 수서역
	{x: 37.545277, y: 127.103349, right: 1, name: "광나루역"},																//97 광나루역
	{x: 37.590266, y: 127.134817, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//98 17번째 환자 자택
	{x: 37.601193, y: 127.132364, right: 1, name: "한양대학교구리병원"},														//99 한양대학교구리병원
	{x: 37.606334, y: 127.139121, right: 1, hospital: 1, name: "삼성서울가정의원"},														//100 삼성서울가정의원
	{x: 37.586948, y: 127.138465, right: 1, name: "프리마트"},																//101 프리마트
	{x: 37.587165, y: 127.138736, right: 1, name: "이삭토스트 구리장자못점"},													//102 이삭토스트 구리장자못점
	{x: 37.599363, y: 127.096883, right: 1, hospital: 1, name: "서울아산내과"},															//103 서울아산내과
	{x: 37.587335, y: 127.138731, right: 1, name: "본죽 구리토평점"},															//104 본죽 구리토핑점
	{x: 35.082296, y: 126.830201, right: 1, name: "우리마트"},																//105 16번째 환자 자택 근처 우리마트
	{x: 37.391769, y: 127.107327, right: 0, name: "분당구 소재 자택(자료 미제공으로 임시 표기하였습니다.)"},				//106 19번째 환자 자택
	{x: 37.371433, y: 127.085639, right: 0, name: "분당구 소재 회사(자료 미제공으로 임시 표기하였습니다.)"},			//107 19번째 환자 회사
	{x: 37.383269, y: 127.081747, right: 0, name: "분당구 소재 부모님 댁(자료 미제공으로 임시 표기하였습니다.)"},		//108 19번째 환자 부모님 댁
	{x: 37.499280, y: 127.112006, right: 1, name: "파리바케트 헬리오시티"},															//109 파리바케트 헬리오시티
	{x: 37.496949, y: 127.120003, right: 1, name: "교촌치킨 가락2호점"},																//110 교촌치킨 가락2호점
	{x: 37.504735, y: 127.027558, right: 1, name: "르메르디앙서울"},																		//111 르메르디앙서울
	{x: 37.381476, y: 126.657157, right: 1, name: "현대프리미엄아올렛 송도점"},																//112 현대프리미엄아올렛 송도점
	{x: 37.495274, y: 127.117502, right: 1, name: "원가네칼국수"},																	//113 원가네칼국수
	{x: 37.377135, y: 127.112755, right: 1, name: "통영별미"},																		//114 통영별미
	{x: 37.304326, y: 127.010171, right: 1, hospital: 1, name: "장안구보건소\n(정부에서 정보를 아무것도 주지 않았기에 이렇게 표시합니다. 죄송합니다.)"},			//115 장안구보건소
	{x: 37.588379, y: 127.004262, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//116  21번째 환자 자택
	{x: 37.602636, y: 127.039521, right: 1, hospital: 1, name: "성북구보건소"},														//117 성북구보건소
	{x: 35.138600, y: 126.926678, right: 1, hospital: 1, name: "조선대학교병원"},														//118조선대학교병원
	{x: 37.565621, y: 126.979442, right: 1, name: "프레지던트호텔"},													//119프레지던트호텔
	{x: 37.564842, y: 126.981911, right: 1, name: "롯데백화점 본점"},													//120롯데백화점 본점
	{x: 37.573261, y: 126.942793, right: 0, name: "서대문구 숙소(자료 미제공으로 임시 표기하였습니다.)"},		//121 23번째 환자 숙소
	{x: 37.542369, y: 126.953359, right: 1, name: "이마트 마포공덕점"},														//122 이마트 마포점
	{x: 37.417568, y: 126.810578, right: 0, name: "시흥시 자택 (자료 미제공으로 임시 표기하였습니다.)"},		//123 25환자 자택
	{x: 37.417261, y: 126.811385, rignt: 1, name: "시흥시 매화활인마트"},												//124 매화활인마트
	{x: 37.444543, y: 126.789515, right: 1, hospital: 1, name: "신천연합의원 선별진료소"},											//125 신천연합의원 선별진료소
	{x: 37.438144, y: 126.796404, right: 1, name: "엘마트 시흥점"},												//126 엘마트 시흥점
	{x: 37.017217, y: 127.260409, right: 1, hospital: 1, name: "경기도의료원 안성병원"},										//127 경기도의료원 안성병원
	{x: 22.157816, y: 113.576506, right: 0, name: "마카오 국제공항"},													//128 마카오 국제공항
	{x: 37.427196, y: 126.783677, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},			//129 27환자 자택
	{x: 37.432339, y: 126.809912, right: 1, name: "태양38년전통그옛날손짜장"},										//130 태양38년전통그옛날손짜장
	{x: 35.863897, y: 128.518489, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},			//131 31번째 환자 자택
	{x: 35.874927, y: 128.562895, right: 0, name: "대구 동구 소재 회사 (자료 미제공으로 임시 표기하였습니다.)"},	//132 31번째 환자 회사
	{x: 35.858388, y: 128.635213, right: 1, hospital: 1, name: "새로난한방병원"},												//133 새로난한방병원
	{x: 35.839714, y: 128.566573, right: 1, name: "신천지예수교 증거장막성전 다대오지파대구교회(대명로 81)"},			//134 신천지 *친*끼들 대구 교회
	{x: 35.882346, y: 128.662136, right: 1, name: "퀸벨호텔 8층"},												//135 퀸벨호텔
	{x: 35.844602, y: 128.612249, right: 1, hospital: 1, name: "수성구 보건소"},												//136 수성구 보건소
	{x: 35.859600, y: 128.540608, right: 1, hospital: 1, name: "대구의료원"},													//137 대구의료원
	{x: 37.574643, y: 127.011443, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},		//138 29환자 자택
	{x: 37.573178, y: 127.016435, right: 1, name: "동묘앞역 1호선"},												//139 동묘앞역 1호선
	{x: 37.576087, y: 127.024717, right: 1, name: "신설동역 1호선"},												//140 신설동역 1호선
	{x: 37.571687, y: 127.010928, right: 1, name: "동대문역 1호선"},												//141 동대문역 1호선
	{x: 37.759406, y: 127.042288, right: 1, name: "녹양역 1호선"},												//142 녹양역 1호선
	{x: 37.575645, y: 127.015406, right: 1, hospital: 1, name: "신중호내과의원"},											//143 신중호내과의원
	{x: 37.572258, y: 127.013962, right: 1, name: "보람약국"},														//144 보람약국
	{x: 37.572492, y: 127.015270, right: 1, hospital: 1, name: "강북서울외과의원"},												//145 강북서울외과의원
	{x: 37.948157, y: 127.060898, right: 1, name: "소요산역 1호선"},													//146 소요산역 1호선
	{x: 37.573290, y: 127.015316, right: 1, name: "봄약국"},														//147 봄약국
	{x: 37.843194, y: 127.061509, right: 1, name: "덕정역"},														//148 덕정역
	{x: 37.579784, y: 127.015222, right: 1, name: "창신역 6호선"},												//149 창신역 6호선
	{x: 37.617314, y: 127.091345, right: 1, name: "봉화산역 6호선"},												//150 봉화산역 6호선
	{x: 37.587321, y: 127.026356, right: 1, hospital: 1, name: "고려대학교 안암병원"},											//151 고려대학교 안암병원
//152 153		152 19			152 145 139 154 155 156 (155 139 157 152)			152 158 159 152			152 153 145 157 152		152 151			152 151(152 19) 
	{x: 37.564040, y: 127.011645, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},		//152 30번째 환자 자택
	{x: 37.567419, y: 127.019386, right: 0, name: "서울시 중구 소재 회사 (자료 미제공으로 임시 표기하였습니다.)"},		//153 30번째 환자 회사
	{x: 37.427508, y: 126.428169, right: 1, name: "인천시 중구 용유도"},															//154 용유도
	{x: 37.569134, y: 126.673852, right: 1, name: "검암역"},																		//155 검암역
	{x: 37.570583, y: 126.672591, right: 0, name: "경인아라뱃길 (자료 미제공으로 임시 표기하였습니다.)"},				//156 경인아라뱃길
	{x: 37.574505, y: 127.015936, right: 1, name: "단골온누리약국"},																//157 단골온누리약국
	{x: 37.572478, y: 127.013272, right: 1, name: "명륜진사갈비 서울동묘점"},														//158 명륜진사갈비 서울동묘점
	{x: 37.572748, y: 127.015982, right: 1, name: "스타벅스 동묘앞역점"},														//159 스타벅스 동묘앞역점
	{x: 37.556591, y: 127.038470, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},					//160 40번째 환자 자택
	{x: 37.539736, y: 127.053101, right: 1, name: "이마트 성수점"},															//161 이마트 성수점
	{x: 37.557029, y: 127.040127, right: 1, name: "포보스 엔터식스한양대점"},													//162 포보스 엔터식스한양대점
	{x: 37.589282, y: 127.064552, right: 1, name: "삼육서울병원 장례식장"},													//163 삼육서울병원 장례식장
	{x: 37.559642, y: 127.043965, right: 1, hospital: 1, name: "한양대학교병원"},															//164 한양대학교 병원
	{x: 37.312426, y: 127.010383, right: 0, name: "자택"},																	//165 15,20,32 자택
	{x: 35.865939, y: 128.605129, right: 1, hospital: 1, name: "경북대학교병원"},															//166 경북대학교병원
	{x: 35.858298, y: 129.196782, right: 1, hospital: 1, name: "동국대학교 경주병원"},													//167 동국대학교 경우병원
	{x: 35.853296, y: 128.480232, right: 1, hospital: 1, name: "계명대학교 동산병원"},													//168 계명대학교 동산병원
	{x: 37.581774, y: 126.969247, right: 1, name: "종로구보건소"},															//169 종로구보건소
	{x: 35.956702, y: 128.564380, right: 1, hospital: 1, name: "칠곡경북대학교병원"},														//170 칠곡경북대학교병원
	{x: 35.847294, y: 128.584899, right: 1, hospital: 1, name: "영남대학교병원"},														//171 영남대학교병원
	{x: 36.034872, y: 129.354929, right: 1, hospital: 1, name: "포항의료원"},									//172 포항의료원
	{x: 36.568106, y: 128.732284, right: 1, hospital: 1, name: "안동의료원"},									//173 안동의료원
	{x: 36.122639, y: 128.126483, right: 1, hospital: 1, name: "김천의료원"},									//174 김천의료원
	{x: 35.847151, y: 127.140609, right: 1, hospital: 1, name: "전북대학교 병원"},									//175 전북대학교 병원
	{x: 35.187232, y: 129.059198, right: 1, hospital: 1, name: "부산의료원"},										//176 부산의료원
	{x: 36.316902, y: 127.415451, right: 1, hospital: 1, name: "충남대학교 병원"},										//177 충남대학교 병원
	{x: 36.605571, y: 127.296381, right: 1, hospital: 1, name: "세종시 보건소"},										//178 세종시 보건소
	{x: 37.015611, y: 127.258262, right: 1, hospital: 1, name: "안성의료원"},											//179 안성의료원
	{x: 35.519982, y: 129.428940, right: 1, hospital: 1, name: "울산대학교 병원"},												//180 울산대학교 병원
	{x: 37.749260, y: 128.888719, right: 1, hospital: 1, name: "강릉의료원"},													//181 강릉의료원
	{x: 37.874972, y: 127.744737, right: 1, hospital: 1, name: "강원대학교 병원"},													//182 강원대학교 병원
	{x: 36.547028, y: 128.700768, right: 1, hospital: 1, name: "안동병원"},														//183 안동병원
	{x: 37.587892, y: 127.065306, right: 1, hospital: 1, name: "삼육서울병원"},												//184 삼육서울병원
	{x: 37.493438, y: 126.923992, right: 1, hospital: 1, name: "보라매병원"},													//185 보라매병원
	{x: 37.282591, y: 127.432820, right: 1, hospital: 1, name: "이천병원"},										//186 이천병원
	{x: 37.645854, y: 127.028579, right: 1, hospital: 1, name: "한일병원"},										//187 한일병원
	{x: 37.754828, y: 126.779751, right: 1, hospital: 1, name: "경기도의료원 파주병원"},							//188 경기도의료원 파주병원
	{x: 36.355215, y: 127.381953, right: 1, hospital: 1, name: "대전을지대학교 병원"},							//189 대전을지대병원
	{x: 35.980668, y: 128.948992, right: 1, name: "자택(야사동 한신더휴 105동)"},									//190 37번재 환자 자택
	{x: 35.904492, y: 128.824877, right: 0, name: "임가네해물촌진량점 (자료 미제공으로 임시 표기하였습니다.)"},		//191 임가네해물촌진량점
	{x: 35.931043, y: 128.872444, right: 1, hospital: 1, name: "영천금호의원"},										//192 영천금호의원
	{x: 35.965180, y: 128.938657, right: 1, hospital: 1, name: "영천김인환내과의원"},										//193 영천님인환내과의원
	{x: 35.961123, y: 128.927798, right: 1, hospital: 1, name: "영천영제한의원"},										//194 영천영제한의원
	{x: 35.902217, y: 128.822870, right: 1, name: "경산스마일배드민턴 체육관"},								//195 경산스마일배드민턴 체육관
	{x: 35.972243, y: 128.937246, right: 0, name: "문외동 자택 (자료 미제공으로 임시 표기하였습니다.)"},		//196 39환자 자택
	{x: 35.970871, y: 128.938573, right: 1, name: "영천시청오거리 버스 승강장"},							//197 영천시청오거리
	{x: 35.871181, y: 128.733624, right: 1, name: "대구지하철 안심역"},									//198 안심역
	{x: 35.865511, y: 128.593417, right: 1, name: "대구지하철 반월당역(1호선)"},						//199 반월당역
	{x: 35.866235, y: 128.590776, right: 0, name: "현대백화점 앞"},									//200 현대백화점 영천 앞
	{x: 35.957346, y: 128.913188, right: 1, hospital: 1, name: "영남대학교영천병원"},								//201 영남대학교영천병원
	{x: 35.963649, y: 128.936681, right: 1, hospital: 1, name: "새영천경대연합정형외과의원"},						//202 새영천경대연합정형외과의원
	{x: 35.968565, y: 128.932456, right: 1, hospital: 1, name: "영천시보건소"},								//203 영천시 보건소
	{x: 35.976862, y: 128.943913, right: 1, name: "자택(야사주공 313동)"},										//204 41, 66환자 자택
	{x: 35.915676, y: 128.819332, right: 1, name: "하양장"},													//205 하양장
	{x: 35.976192, y: 128.944849, right: 1, hospital: 1, name: "안심의원"},												//206 안심의원
	{x: 35.976063, y: 128.950089, right: 1, name: "큰사랑지역아동센터"},										//207 큰사랑지역아동센터
	{x: 35.975616, y: 128.950603, right: 1, name: "탑마트 영천점"},											//208 탑마트 영천점
	{x: 35.819742, y: 128.749762, right: 0, name: "계양동 자택 (자료 미제공으로 임시 표기하였습니다.)"},				//209 67환자 자택
	{x: 35.841683, y: 128.704940, right: 1, hospital: 1, name: "시지 닥터필 의원"},										//210 시지 닥터필 의원
	{x: 35.859401, y: 128.645931, right: 1, hospital: 1, name: "대구메트로병원"},										//211 대구메트로병원
	{x: 35.860023, y: 128.613804, right: 1, hospital: 1, name: "예일연합이비인후과"},										//212 예일이비인후과
	{x: 35.817523, y: 128.753156, right: 1, hospital: 1, name: "미래연합의원(사동)"},									//213 미래연합의원(사동)
	{x: 35.824996, y: 128.743325, right: 1, hospital: 1, name: "경산시 보건소"},										//214 경산시 보건소
	{x: 35.810473, y: 128.725781, right: 1, name: "옥곡동 자택 (자료 미제공으로 임시 표기하였습니다.)"},			//215 73환자 자택
	{x: 35.812999, y: 128.732577, right: 1, hospital: 1, name: "옥곡동 혜화연합의원"},										//216 혜화연합의원
	{x: 37.581557, y: 126.999444, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},					//217 83환자 자택
	{x: 37.576675, y: 127.005993, right: 1, name: "종로노인종합복지관"},											//218 종로노인종합복지관
	{x: 35.836724, y: 128.557794, right: 1, name: "대구 서부터미널"},											//219 대구 서부터미널
	{x: 36.017741, y: 129.345610, right: 0, name: "지인 집(대잠 아델리아)"},									//220 85지인집
	{x: 36.060835, y: 129.375418, right: 1, name: "리플러스 장서점"},										//221 리플러스 장서점
	{x: 36.069356, y: 129.380114, right: 0, name: "자택(두호시영 1차 아파트)"},								//222 85자택 두호시영 1차 아파트
	{x: 36.018137, y: 129.341987, right: 1, hospital: 1, name: "코아이비인후과"},										//223 코아이비인후과
	{x: 36.017814, y: 129.362100, right: 1, hospital: 1, name: "세명기독병원(선별진료소)"},								//224 세명기독병원
	{x: 35.804521, y: 128.732112, right: 0, name: "옥곡동 자택 (자료 미제공으로 임시 표기하였습니다.)"},			//225 91자택
	{x: 35.812058, y: 128.732584, right: 1, name: "옥곡동 우리횟집"},										//226 우리횟집
	{x: 35.827716, y: 128.734558, right: 0, name: "중방동 자택"},										//227 105환자 자택
	{x: 35.817064, y: 128.759703, right: 1, name: "경산세무서"},											//228 경산세무서
	{x: 35.825070, y: 128.741441, right: 1, name: "경산시청"},											//229 경산시청
	{x: 35.829140, y: 128.736241, right: 1, name: "롤링핀 경산점"},									//230 롤링핀 경산점
	{x: 35.829140, y: 128.736241, right: 1, hospital: 1, name: "경대연합용한속내과의원"},							//231 경대연합용한속내과의원
	{x: 35.823767, y: 128.733369, right: 0, name: "중방동 자택"},									//232 106환자 자택
	{x: 35.824221, y: 128.737736, right: 1, hospital: 1, name: "김동희 속내과의원"},								//233 김동희속내과의원
	{x: 35.826306, y: 128.738099, right: 1, name: "촌순두부청국장전문"},								//234 촌순두부청국장전문
	{x: 35.827241, y: 128.736736, right: 1, name: "스타벅스 경산중방dt점"},							//235 스타벅스 경산중방
	{x: 37.608988, y: 126.928365, right: 1, name: "은평구 대조동 티파니모텔"},										//236 티파니모텔
	{x: 37.608987, y: 126.928168, right: 0, name: "은평구 대조동 대박집식당"},							//237 대박집
	{x: 37.612347, y: 126.927424, right: 1, name: "톰플러스모텔"},									//238 톰플러스 모텔
	{x: 37.581386, y: 126.926456, right: 1, name: "서대문구 홍은동 소반"},									//239 소반
	{x: 37.581441, y: 126.911172, right: 1, name: "북가좌2동 주민센터"},								//240 북가좌2동 주민센터
	{x: 37.578391, y: 126.923865, right: 1, name: "남가좌2동 주민센터"},								//241 남가좌2동 주민센터
	{x: 37.580058, y: 126.934143, right: 1, name: "홍은2동 주민센터"},									//242 홍은2동주민센터
	{x: 37.686308, y: 126.720008, right: 1, name: "가좌보건지소"},									//243 가좌보건지소
	{x: 37.574267, y: 126.910157, right: 1, name: "북가좌1동 주민센터"},								//244 북가좌1동 주민센터
	{x: 37.556181, y: 126.937695, right: 1, name: "창천동 쉬크모텔"},									//245 쉬크모텔
	{x: 37.556995, y: 126.937732, right: 1, name: "미니스톱 연대점"},									//246 미니스톱 연대점
	{x: 37.566309, y: 126.902081, right: 1, hospital: 1, name: "마포구 보건소"},									//247 마포구 보건소
	{x: 35.127640, y: 126.894981, right: 0, name: "주월동 자택 (자료 미제공으로 임시 표기하였습니다.)"},			//248 126자택
	{x: 35.130124, y: 126.891920, right: 0, name: "주월동 학습관 (자료 미제공으로 임시 표기하였습니다.)"},		//249 126학습관
	{x: 35.238514, y: 127.014401, right: 1, name: "담양 창평국밥"},										//250 창평국밥
	{x: 35.127305, y: 126.896261, right: 1, name: "주월동 소요(카페)"},									//251 소요
	{x: 35.135397, y: 126.895601, right: 1, name: "백운동 최가박당"},										//252 최가박당
	{x: 35.132981, y: 126.902444, right: 1, hospital: 1, name: "광주시 남구보건소"},										//253 남구보건소
	{x: 35.126188, y: 126.911148, right: 1, name: "봉선동 사계진미숯불갈비"},									//254 사계진미숯불닭갈비
	{x: 35.127232, y: 126.917926, right: 1, name: "아이리스팝피시방 방림점"},									//255 아이리스팝피시방
	{x: 35.152283, y: 126.889918, right: 1, hospital: 1, name: "광주시 서구보건소"},									//256 서구보건소
	{x: 37.588485, y: 126.946794, right: 0, name: "홍제동 자택 (자료 미제공으로 임시 표기하였습니다.)"},		//257 161자택
	{x: 37.587168, y: 126.946349, right: 1, name: "홍제동 펀앤펀 pc방"},								//258 펀앤펀피씨 황제동
	{x: 37.590230, y: 126.942881, right: 1, name: "홍제동 기린약국"},									//259 홍제동 기린약국
	{x: 37.590225, y: 126.942850, right: 1, hospital: 1, name: "홍제동 중앙내과의원"},								//260 중앙내과의원
	{x: 35.140702, y: 126.891723, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//261 164자택
	{x: 35.148611, y: 126.900008, right: 0, name: "월산동 학습관 (자료 미제공으로 임시 표기하였습니다.)"},		//262 164학습관
	{x: 35.145591, y: 126.923211, right: 1, hospital: 1, name: "광주시 동구보건소"},									//263 동구보건소
	{x: 35.205940, y: 129.081039, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//264 200자택
	{x: 35.215016, y: 129.073918, right: 1, name: "부산전자공고(운동장)"},										//265 부산전자공고
	{x: 35.219578, y: 129.081124, right: 1, name: "대성탕(공중목욕탕)"},									//266 대성탕
	{x: 35.198329, y: 129.084167, right: 1, name: "동래밀면 본점"},										//267 동래밀면
	{x: 35.205790, y: 129.086093, right: 1, name: "복산동 주민센터"},										//268 복산동 주민센터
	{x: 35.196500, y: 129.093092, right: 1, name: "동래구청(낙민동)"},										//269 동래구청(낙민동)
	{x: 35.206351, y: 129.101865, right: 0, name: "명장동 gs더프레시"},									//270 gs더프레시 명장동
	{x: 35.215993, y: 129.077142, right: 1, name: "온천교회"},											//271 온천교회
	{x: 35.154381, y: 129.119054, right: 1, name: "피자몰 광안리점"},										//272 피자몰 광안리점
	{x: 35.197986, y: 129.120941, right: 1, name: "gs25 동래꿈에그린점"},									//273 gs25 동래꿈에그린점
	{x: 35.204242, y: 129.080171, right: 1, hospital: 1, name: "대동병원 선별진료소"},									//274 대동병원 선별진료소
	{x: 35.204558, y: 129.081056, right: 1, name: "동래메가마트"},										//275 동래메가마트
	{x: 35.199451, y: 129.098631, right: 1, name: "얼쑤대박터지는집 안락동"},								//276 얼쑤대박터지는(?)집
	{x: 35.211380, y: 129.079868, right: 1, hospital: 1, name: "동래구 보건소"},										//277 동래구 보건소
	{x: 35.648616, y: 128.736827, right: 1, hospital: 1, name: "청도대남병원"},										//278 청도대남병원
	{x: 35.100812, y: 129.018731, right: 1, hospital: 1, name: "부산대학교 병원"},									//279 부산대학교 병원
	{x: 36.041325, y: 129.369292, right: 0, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},			//280 207자택
	{x: 35.884223, y: 128.555208, right: 0, name: "대구 시외버스터미널"},							//281 대구시외버스터미널
	{x: 36.069655, y: 129.378870, right: 1, name: "신천지 포항교회"},								//282 신천지 포항
	{x: 36.036655, y: 129.362951, right: 1, name: "에슐리 중앙상가"},								//283 에슐리 중앙상가
	{x: 36.035028, y: 129.365558, right: 1, name: "죽도시장길 달콤커피"},							//284 달콤커피
	{x: 36.025097, y: 129.359091, right: 1, name: "중흥로 동원성"},								//285 동원성
	{x: 36.031660, y: 129.364915, right: 1, name: "김밥나라(오거리 우리은행 옆)"},					//286 김밥나라 오거리
	{x: 36.037815, y: 129.364092, right: 1, name: "중앙상가길 맥도날드"},						//287 중앙상가 맥도날드
	{x: 36.028014, y: 129.360924, right: 1, name: "죽파pc존"},									//288 죽파pc존
	{x: 35.992423, y: 129.396234, right: 1, hospital: 1, name: "포항시 남구보건소"},							//289 포항시 남구보건소
	{x: 35.172547, y: 126.890031, right: 1, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},					//290 210자택 
	{x: 35.149179, y: 126.926501, right: 1, name: "동명동 동명식빵"},										//291 동명식빵
	{x: 35.173358, y: 126.913990, right: 1, name: "중흥동 중흥헬스"},											//292 중흥헬스
	{x: 35.154869, y: 126.854345, right: 1, name: "치평동 텐토"},												//293 텐토
	{x: 35.208994, y: 126.878987, right: 1, name: "양상동 양떼목장"},											//294 양상동 양떼목장
	{x: 35.176932, y: 126.896253, right: 1, name: "사무실 (자료 미제공으로 임시 표기하였습니다.)"},				//295 210사무실
	{x: 34.610357, y: 127.278242, right: 0, name: "전라남도 고흥읍 소재 실버대학"},								//296 고흥 실버대학
	{x: 34.525773, y: 127.135669, right: 1, name: "고흥 뚝배기식당"},											//297 고흥뚝배기식당
	{x: 35.173352, y: 126.912178, right: 1, hospital: 1, name: "광주광역시 북구보건소"},									//298 광주 복구보건소
	{x: 35.823014, y: 128.718339, right: 1, name: "자택 (자료 미제공으로 임시 표기하였습니다.)"},				//299 211자택
	{x: 35.827740, y: 128.725844, right: 1, name: "옥산동 청해수산"},										//300 옥산동 청해수산
	{x: 35.831438, y: 128.719767, right: 1, hospital: 1, name: "중산동 펜타힐즈연합내과의원"},							//301 펜타힐즈연합내과의원
	{x: 37.487465, y: 127.101329, right: 1, name: "수서역"},												//302 수서역
	{x: 35.114827, y: 129.041493, right: 1, name: "부산역"},												//303 부산역
	{x: 35.204263, y: 129.122006, right: 0, name: "해운대구 자택 (자료 미제공으로 임시 표기하였습니다.)"},		//304 231자택
	{x: 35.205773, y: 129.125582, right: 1, name: "장산성당"},												//305 장산성당
	{x: 35.199085, y: 129.119151, right: 1, name: "반여동 장산명가"},										//306 장산명가
	{x: 35.199539, y: 129.116726, right: 1, name: "자연드림 부산반여점"},								//307 자연드림 부산반여점
	{x: 35.202697, y: 129.119948, right: 1, hospital: 1, name: "센텀내과의원"},										//308 센텀내과의원
	{x: 35.173491, y: 129.181972, right: 1, hospital: 1, name: "해운대백병원"},										//309 해운대백병원
	{x: 35.164110, y: 129.178660, right: 1, hospital: 1, name: "해운대구 보건소"},										//310 해운대보건소
];

document.onmousemove = function(e){                 /*마우스의 좌표 감지*/
	$("#map_inform").css("top", `${e.pageY}px`);
	$("#map_inform").css("left", `${e.pageX}px`);
}

$(document).ready(function(){
	// $("#momap").prepend("<div id=\"map_inform\"></div>");
	getroute();
});

function initMap() {
	var a;
  
	// The location of Uluru
 	// The map, centered at Uluru
 	if (mobile == 1) {
		a=7;
	} else {
		a=8;
	}
	map = new google.maps.Map(
		document.getElementById('map1'), {
			zoom: a,
			center: {lat: 36.629555, lng: 127.886999},
			gestureHandling: 'greedy',
			mapTypeControl: false
		}
	);
	var lineSymbol = {												//화사표 아이콘 패치
		path: google.maps.SymbolPath.FORWARD_CLOSED_ARROW
	};
	
	for (a=0; a<point.length; a++) {										//구글맵에 아이콘 붙이기
		var image = {};
		if (point[a].hospital == 1) {
			image.n = 0;
			image.l = '/static/img/green.png';
		} else if (point[a].right == 1) {
			image.n = 1;
			image.l = '/static/img/red.png';
		} else {
			image.n = 2;
			image.l = '/static/img/blue.png';
		}
		marker[a] = new google.maps.Marker({
    		map:map,
			position: {lat: point[a].x, lng: point[a].y},
			num: a,
    		// position: new google.maps.LatLng(point[a].x, point[a].y),
    		//icon: '/static/Group_1.png', // null = default icon
			icon_num: image.n,
			icon: image.l,
			title: point[a].name
  		});
		inform[a] = new google.maps.InfoWindow({
    		content: "<div style=\"color: black;\">"+marker[a].title+"</div>"
  		});
		marker[a].addListener('click', function() {
			console.log(this.num);
			if (mobile == 1) {
				click(this.num);
			} else {
				inform[this.num].open(map, marker[this.num]);
			}
			console.log(this);
    		//inform[this.num].open(map, marker[this.num]);
  		});
	}
	
	for (a=0; a<route.length; a++) {				//구글맵에 선그리기
    
		var flightPlanCoordinates = [
    		{lat: 1*(point[1*(route[a].point1)].x), lng: 1*(point[1*(route[a].point1)].y)},
    		{lat: 1*(point[1*(route[a].point2)].x), lng: 1*(point[1*(route[a].point2)].y)}
  		];
      isEmpty[route[a].person_num] = true;
    
		console.log(a + "/" + route.length);
  		flightPath[a] = new google.maps.Polyline({
  		  path: flightPlanCoordinates,
		  icons: [{
    		icon: lineSymbol,
    		offset: '90%'
		  }],
  		  geodesic: true,
  		  strokeColor: route[a].color,
  		  strokeOpacity: 1.0,
 		  strokeWeight: 3,
		  num: a,
  		});
		flightPath[a].addListener('mouseover', function(event) {
			overdiv[this.num] = 1;
			if (route[this.num].save == 0) {																						//person_num 이 0이라면 우환귀국교민으로 간주
				if (route[this.num].person_num == 0) {
					$("#map_inform").text(`${route[this.num].date}, 우환귀국교민, 바이러스 노출 위험이 있다고 판단되는 경로입니다.`);
				} else {
					$("#map_inform").text(`${route[this.num].date}, ${route[this.num].person_num}번째 감염자, 바이러스 노출 위험이 있다고 판단되는 경로입니다.`);
				}
			} else {
				if (route[this.num].person_num == 0) {
					$("#map_inform").text(`${route[this.num].date}, 우환귀국교민, 병원이송 등으로 안전하다고 판단된 경로입니다.`);
				} else {
					$("#map_inform").text(`${route[this.num].date}, ${route[this.num].person_num}번째 감염자, 병원이송 등으로 안전하다고 판단된 경로입니다.`);
				}
			}
			$("#map_inform").css("display", "block");
  		});
		flightPath[a].addListener('mouseout', function(event) {
			if (overdiv[this.num] == 1) {
				overdiv[this.num] = 0;
				$("#map_inform").css("display", "none");
			}
  		});
		// flightPath[a].addListener('mouseout', function(event) {
		// // $("#map_information").css("display", "none");
		// });
		flightPath[a].setMap(map);
	}
	for (f=1; f<=all; f++) {//
    // isempty 써도 이중for 써야할것 같아요 음 아닐텐데 ㅠㅠ  //일단 이중으로 만들테니까 창완님이 for 한개로 되게 수정좀...
          //음 변수 f는 단순 반복용으로 쓰이는거라 ㄹ
		if(isEmpty[f]) {
            console.log("YEAH!!");
      		chek_infecon[f]=0;
			if (mobile == 1) {
				$('#searchbtn_map_infecon').append('<p><button class="btn btn-danger srbtns_long" onclick="setlocation_infecon('+f+')" id="searchbtn'+f+'">'+f+'</button></p>');
			} else {
				$('#searchbtn_map_infecon').append('<div><button id="searchbtn'+f+'" class="searchbtns btn btn-danger btn-block" onclick="setlocation_infecon('+f+')">'+f+'</button></div>');
			}
       	}
  	}
}

function getroute() {
	$.getJSON('/static/data/route.json', function(data){
		route = data.route;
		console.log(route);
		initMap();
	});
}

function upmak(what) {
	switch (marker[what].icon_num) {
		case 0: marker[what].setIcon('/static/img/green_big.png'); break;
		case 1: marker[what].setIcon('/static/img/red_big.png'); break;
		case 2: marker[what].setIcon('/static/img/blue_big.png'); break;
	}
}

function dwmak(what) {
	switch (marker[what].icon_num) {
		case 0: marker[what].setIcon('/static/img/green.png'); break;
		case 1: marker[what].setIcon('/static/img/red.png'); break;
		case 2: marker[what].setIcon('/static/img/blue.png'); break;
	}
}
